## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_wafv2_regex_pattern_set.forms_base_url` |
| update | `aws_wafv2_web_acl.forms_acl`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.forms_base_url will be created
  + resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
      + arn         = (known after apply)
      + description = "Regex matching the root domain of GCForms"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "forms_base_url"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + regular_expression {
          + regex_string = "forms-staging.cdssandbox.xyz$"
        }
    }

  # aws_wafv2_web_acl.forms_acl will be updated in-place
  ~ resource "aws_wafv2_web_acl" "forms_acl" {
        id         = "e8fc1b67-9d4d-4a29-8c94-65b37b30a231"
        name       = "GCForms"
        tags       = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      + rule {
          + name     = "PreventHostInjections"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + not_statement {
                  + statement {
                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {
                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PreventHostInjections"
              + sampled_requests_enabled   = true
            }
        }

        # (8 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]
FAIL - plan.json - main - WAF rules have duplicate priorities: ["aws_wafv2_web_acl.forms_acl"]

19 tests, 16 passed, 2 warnings, 1 failure, 0 exceptions

```

</details>
